### MultiIndex

In [4]:
import pandas as pd
import numpy as np

ModuleNotFoundError: No module named 'pandas'

In [4]:
index = [('California', '2000'), ('California', '2010'),
            ('New York', '2000'), ('New York', '2010'),
            ('Texas', '2000'), ('Texas', '2010')]
populations = [33871648, 37253956,
                18976457, 19378102,
                20851820, 25145561]
# NOT recommended
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [5]:
pop[[i for i in pop.index if i[1]=='2010']]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [6]:
# Pandas MultiIndex
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', '2000'),
            ('California', '2010'),
            (  'New York', '2000'),
            (  'New York', '2010'),
            (     'Texas', '2000'),
            (     'Texas', '2010')],
           )

In [7]:
pop2 = pd.Series(populations, index=index)
pop2

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [8]:
# reindex also works
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [9]:
# selection based on index, i.e. 2010
pop[:, '2010']

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [10]:
pop['California']

2000    33871648
2010    37253956
dtype: int64

In [13]:
##extra dimension to a conventionally indexed DataFrame
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [14]:
pop_df.stack() ##by rows

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [15]:
pop_df.T.stack() ##by columns

2000  California    33871648
      New York      18976457
      Texas         20851820
2010  California    37253956
      New York      19378102
      Texas         25145561
dtype: int64

#### MultiIndex Creation

In [18]:
#pass a list of two or more index arrays
df = pd.DataFrame(np.random.rand(4, 2),
                    index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                    columns=['data1', 'data2'])
df

        data1     data2
a 1  0.306537  0.858850
  2  0.576265  0.975910
b 1  0.935466  0.831977
  2  0.819297  0.052013

In [19]:
#pass a dictionary with appropriate tuples as keys
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

#### Construct MultiIndex

In [20]:
#array
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [21]:
#tuple
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [22]:
#product
pd.MultiIndex.from_product([['a', 'b'], [1, 2, 3]])

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3)],
           )

In [23]:
#MultiIndex with names: keep track of the meaning of index values
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

#### MultiIndex for Columns

In [24]:
# hierarchical indices
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                    names=['year', 'visit'])
index

MultiIndex([(2013, 1),
            (2013, 2),
            (2014, 1),
            (2014, 2)],
           names=['year', 'visit'])

In [25]:
# hierarchical columns
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], 
                                      ['HR', 'Temp']],
                                    names=['subject', 'type'])
columns

MultiIndex([(  'Bob',   'HR'),
            (  'Bob', 'Temp'),
            ('Guido',   'HR'),
            ('Guido', 'Temp'),
            (  'Sue',   'HR'),
            (  'Sue', 'Temp')],
           names=['subject', 'type'])

In [30]:
# mock some data
data = np.round(np.random.randn(4, 6), 1) #standard normal; round to 0.1 (Important!)
#np.random.randn(4, 6)
data

array([[ 0.4, -0. , -0.8, -0. , -1.8, -0.6],
       [-0.1, -0.7, -0.8, -1.2, -0.9,  1.2],
       [ 1.3,  1.6,  0.1,  0.7, -0.1, -0.4],
       [ 0.9,  2.5,  0. , -1.9,  2.2, -0. ]])

In [31]:
data[:, ::2] *= 10
data += 37
data

array([[41. , 37. , 29. , 37. , 19. , 36.4],
       [36. , 36.3, 29. , 35.8, 28. , 38.2],
       [50. , 38.6, 38. , 37.7, 36. , 36.6],
       [46. , 39.5, 37. , 35.1, 59. , 37. ]])

In [32]:
# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      41.0  37.0  29.0  37.0  19.0  36.4
     2      36.0  36.3  29.0  35.8  28.0  38.2
2014 1      50.0  38.6  38.0  37.7  36.0  36.6
     2      46.0  39.5  37.0  35.1  59.0  37.0

#### Indexing and Slicing

#### For Series:

In [33]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [34]:
pop['California', '2000']

33871648

In [35]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [36]:
# perform partial indexing on lower levels by passing an
# empty slice in the first index
pop[:, '2000']

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [37]:
# selection based on Boolean
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [38]:
# fancy indexing
pop[['California', 'Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

#### For DataFrame:

In [39]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      41.0  37.0  29.0  37.0  19.0  36.4
     2      36.0  36.3  29.0  35.8  28.0  38.2
2014 1      50.0  38.6  38.0  37.7  36.0  36.6
     2      46.0  39.5  37.0  35.1  59.0  37.0

In [40]:
health_data['Guido', 'HR']

year  visit
2013  1        29.0
      2        29.0
2014  1        38.0
      2        37.0
Name: (Guido, HR), dtype: float64

In [41]:
#loc, iloc
health_data.iloc[:2, 2:4]

subject    Guido
type          HR  Temp
year visit
2013 1      29.0  37.0
     2      29.0  35.8

In [42]:
health_data.loc[:,('Bob','Temp')]

year  visit
2013  1        37.0
      2        36.3
2014  1        38.6
      2        39.5
Name: (Bob, Temp), dtype: float64

In [43]:
health_data.loc[(2013,1),('Bob','Temp')]

37.0

In [44]:
#slice within the tuple does not work
health_data.loc[(2013,:),('Bob','Temp')]

SyntaxError: invalid syntax (<ipython-input-44-9f3f603bfd09>, line 2)

In [45]:
#instead
health_data.loc[[2013],('Bob','Temp')]

year  visit
2013  1        37.0
      2        36.3
Name: (Bob, Temp), dtype: float64

In [46]:
# building the desired slice explicitly using an IndexSlice
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      41.0  29.0  19.0
2014 1      50.0  38.0  36.0

In [47]:
pd.IndexSlice?

#### Rearranging Multi_indices

In [48]:
# data example
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]],
                                    names=['char', 'int'])
data = pd.Series(np.random.rand(6), index=index)
#alternative way to specify index names
#data.index.names = ['char', 'int'] 
data

char  int
a     1      0.478683
      2      0.294016
c     1      0.938156
      2      0.267384
b     1      0.639284
      2      0.824106
dtype: float64

In [49]:
#does not work for unsorted index
data['a':'b']

UnsortedIndexError: 'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [50]:
# sorting
data = data.sort_index()
data

char  int
a     1      0.478683
      2      0.294016
b     1      0.639284
      2      0.824106
c     1      0.938156
      2      0.267384
dtype: float64

In [51]:
#now working
data['a':'b']

char  int
a     1      0.478683
      2      0.294016
b     1      0.639284
      2      0.824106
dtype: float64

#### stacking and unstacking

In [52]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [53]:
pop.unstack(level=0) #specify the level

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [54]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [55]:
pop.unstack(level=1).stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [56]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [57]:
pop.unstack(level=0).stack()

year  state
2000  California    33871648
      New York      18976457
      Texas         20851820
2010  California    37253956
      New York      19378102
      Texas         25145561
dtype: int64

#### Index setting and resetting

In [58]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

reset_index: turn the index labels into columns;<br>
result in a DataFrame with columns holding the information that was formerly in the index.

In [59]:
#optionally specify the name of the data for the column representation
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [60]:
#on the other hand
#build a MultiIndex from the column values
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

#### Data Aggregation

In [61]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      41.0  37.0  29.0  37.0  19.0  36.4
     2      36.0  36.3  29.0  35.8  28.0  38.2
2014 1      50.0  38.6  38.0  37.7  36.0  36.6
     2      46.0  39.5  37.0  35.1  59.0  37.0

In [65]:
# name the index level
health_data.mean(level='year')

subject   Bob        Guido         Sue
type       HR   Temp    HR  Temp    HR  Temp
year
2013     38.5  36.65  29.0  36.4  23.5  37.3
2014     48.0  39.05  37.5  36.4  47.5  36.8

In [70]:
#axis=1: columns; otherwise do not work
health_data.mean(level='type')

KeyError: 'Level type not found'

In [74]:
#axis=1: columns
health_data.mean(axis=1, level='type')

type               HR       Temp
year visit
2013 1      29.666667  36.800000
     2      31.000000  36.766667
2014 1      41.333333  37.633333
     2      47.333333  37.200000

In [75]:
health_data.mean(level='year')

subject   Bob        Guido         Sue
type       HR   Temp    HR  Temp    HR  Temp
year
2013     38.5  36.65  29.0  36.4  23.5  37.3
2014     48.0  39.05  37.5  36.4  47.5  36.8

In [76]:
#first year then type
health_data.mean(level='year').mean(axis=1, level='type')

type         HR       Temp
year
2013  30.333333  36.783333
2014  44.333333  37.416667

In [77]:
#first type then year: same
health_data.mean(axis=1, level='type').mean(level='year')

type         HR       Temp
year
2013  30.333333  36.783333
2014  44.333333  37.416667

## Pandas: Combining Datasets

In [78]:
#import and auxiliary functions
import pandas as pd
import numpy as np

def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind] for c in cols}
    return pd.DataFrame(data, ind)

# example DataFrame
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

#### Contatenation using concat

In [79]:
#Recall numpy
x = [[1,2],
    [3,4]]
np.concatenate([x,x], axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

In [80]:
#pd.concat
#pd.concat(objs, axis=0, join='outer', join_axes=None, 
#          ignore_index=False,keys=None, levels=None,
#          names=None, verify_integrity=False, copy=True)

In [81]:
pd.concat?

In [82]:
# series
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6]) #duplicated indices also work
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [83]:
#DataFrames
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])
print(df1,'\n'); print(df2,'\n')
print(pd.concat([df1, df2]), '\n')
print(pd.concat([df1, df2], axis=1)) #along the column; match indices

    A   B
1  A1  B1
2  A2  B2

    A   B
3  A3  B3
4  A4  B4

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

     A    B    A    B
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3  NaN  NaN   A3   B3
4  NaN  NaN   A4   B4

In [84]:
print(pd.concat([df1, df2], axis=1, join="inner"))

Empty DataFrame
Columns: [A, B, A, B]
Index: []

In [88]:
##deal with duplicate indices
print(pd.concat([df1, df1]), '\n')

    A   B
1  A1  B1
2  A2  B2
1  A1  B1
2  A2  B2

In [87]:
print(pd.concat([df1, df1], verify_integrity=True))

ValueError: Indexes have overlapping values: Int64Index([1, 2], dtype='int64')

In [91]:
# ignore: reordered
print(pd.concat([df2, df1]), '\n')
print(pd.concat([df2, df1], ignore_index=True))

    A   B
3  A3  B3
4  A4  B4
1  A1  B1
2  A2  B2

    A   B
0  A3  B3
1  A4  B4
2  A1  B1
3  A2  B2

In [92]:
# add keys indicating sources
df3 = df1
df4 = pd.concat([df1, df3], keys=['df1','df3'])
print(df4)

        A   B
df1 1  A1  B1
    2  A2  B2
df3 1  A1  B1
    2  A2  B2

In [93]:
df4.index

MultiIndex([('df1', 1),
            ('df1', 2),
            ('df3', 1),
            ('df3', 2)],
           )

In [94]:
# union/intersection of the input columns
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
print(df5,'\n'); print(df6,'\n')
print(pd.concat([df5, df6]),'\n')

#intersection: inner
print(pd.concat([df5, df6],join='inner'))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2

    B   C   D
3  B3  C3  D3
4  B4  C4  D4

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

#### Concatenation using append

In [95]:
print(df2.append(df1))

    A   B
3  A3  B3
4  A4  B4
1  A1  B1
2  A2  B2

#### Merge

In [96]:
#one to one join
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
print(df1,'\n'); print(df2,'\n')

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [97]:
df3 = pd.merge(df1, df2)
print(df3,'\n')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [98]:
#many to one join
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
print(df3,'\n'); print(df4,'\n'); 
#additional column with the “supervisor” information,
# information repeated as required by the inputs
print(pd.merge(df3, df4))

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [99]:
#many to many join
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})
print(df1,'\n'); print(df5,'\n')
print(pd.merge(df1, df5))
#group correspond to two skills, thus two rows per employee

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [100]:
# specify the merge key
print(df1,'\n'); print(df2,'\n'); print(pd.merge(df1, df2, on='employee'))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [101]:
pd.concat([df1,df2],axis=1) #not useful

  employee        group employee  hire_date
0      Bob   Accounting     Lisa       2004
1     Jake  Engineering      Bob       2008
2     Lisa  Engineering     Jake       2012
3      Sue           HR      Sue       2014

In [102]:
# different keys for different datasets
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
print(df1,'\n'); print(df3,'\n');
print(pd.merge(df1, df3, left_on="employee", right_on="name"))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [103]:
# drop the duplicated one
pd.merge(df1, df3, 
         left_on="employee", right_on="name").drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [104]:
#index merge: employee as the row index this time
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
print(df1a,'\n'); print(df2a,'\n')

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [105]:
#then merge using indices
print(pd.merge(df1a, df2a, left_index=True, right_index=True))

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [106]:
# join(): merge using indices by default
print(df1a.join(df2a))

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [107]:
# mixed of index and column
print(pd.merge(df1a, df3, left_index=True, right_on='name')) #by default keep the name column

         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

#### Row-wise consideration

In [108]:
#example
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])
print(df6,'\n'); print(df7,'\n');

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

     name drink
0    Mary  wine
1  Joseph  beer

In [109]:
print(pd.merge(df6, df7),'\n')
#equivalent
print(pd.merge(df6, df7, how='inner'))

   name   food drink
0  Mary  bread  wine

   name   food drink
0  Mary  bread  wine

In [110]:
#how argument
print(pd.merge(df6, df7, how='outer'),'\n')

print(pd.merge(df6, df7, how='left'),'\n')

print(pd.merge(df6, df7, how='right'))

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

#### Overlapping column names

In [111]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [3, 1, 4, 2]})
print(df8,'\n'); print(df9,'\n')

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

In [112]:
print(pd.merge(df8, df9, on="name"),'\n')
print(pd.merge(df8, df9, on="name", suffixes=["_2021", "_2022"])) #helpful for longitudinal data, etc.

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

   name  rank_2021  rank_2022
0   Bob          1          3
1  Jake          2          1
2  Lisa          3          4
3   Sue          4          2

### GroupBy: Conditional Aggregation

In [113]:
import pandas as pd
import numpy as np
np.random.seed(1234)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': range(6),
                   'random': np.random.random(6)}, columns=['key', 'data', 'random'])
df

  key  data    random
0   A     0  0.191519
1   B     1  0.622109
2   C     2  0.437728
3   A     3  0.785359
4   B     4  0.779976
5   C     5  0.272593

In [114]:
# DataFrameGroupBy object: group data by the desired key column
df.groupby('key')

In [115]:
print(df.groupby('key').sum())

     data    random
key
A       3  0.976878
B       5  1.402085
C       7  0.710320

In [116]:
print(df.groupby('key')['random'].sum())

key
A    0.976878
B    1.402085
C    0.710320
Name: random, dtype: float64

In [117]:
print(df.groupby('key').min())

     data    random
key
A       0  0.191519
B       1  0.622109
C       2  0.272593

In [118]:
# iteration over groups
for (key, group) in df.groupby('key'):
    print((key,group),'\n')
for (key, group) in df.groupby('key'):
    print("{} shape={}".format(key, group.shape))

('A',   key  data    random
0   A     0  0.191519
3   A     3  0.785359)

('B',   key  data    random
1   B     1  0.622109
4   B     4  0.779976)

('C',   key  data    random
2   C     2  0.437728
5   C     5  0.272593)

A shape=(2, 3)
B shape=(2, 3)
C shape=(2, 3)

In [119]:
# describe()
df.groupby('key')['random'].describe()

,count,mean,std,min,25%,50%,75%,max
key,,,,,,,,
A,2.0,0.488439,0.419908,0.191519,0.339979,0.488439,0.636899,0.785359
B,2.0,0.701042,0.111629,0.622109,0.661576,0.701042,0.740509,0.779976
C,2.0,0.355160,0.116768,0.272593,0.313876,0.355160,0.396444,0.437728

#### Aggregate, filter, transform, apply

In [120]:
#take a string, a function, or a list
df.groupby('key').aggregate(['min', np.median, max])

    data               random
     min median max       min    median       max
key
A      0    1.5   3  0.191519  0.488439  0.785359
B      1    2.5   4  0.622109  0.701042  0.779976
C      2    3.5   5  0.272593  0.355160  0.437728

In [121]:
#dictionary mapping
df.groupby('key').aggregate({'data': ['min','mean'],
                             'random': 'max'})

    data         random
     min mean       max
key
A      0  1.5  0.785359
B      1  2.5  0.779976
C      2  3.5  0.437728

In [122]:
#filtering
def filter_func(x):
    return x['random'].min() < 0.3
print(df, '\n'); 
print(df.groupby('key').min(), '\n')
print(df.groupby('key').filter(filter_func))

  key  data    random
0   A     0  0.191519
1   B     1  0.622109
2   C     2  0.437728
3   A     3  0.785359
4   B     4  0.779976
5   C     5  0.272593

     data    random
key
A       0  0.191519
B       1  0.622109
C       2  0.272593

  key  data    random
0   A     0  0.191519
2   C     2  0.437728
3   A     3  0.785359
5   C     5  0.272593

In [124]:
df

  key  data    random
0   A     0  0.191519
1   B     1  0.622109
2   C     2  0.437728
3   A     3  0.785359
4   B     4  0.779976
5   C     5  0.272593

In [123]:
# transformation
# example:center the data by subtracting the group-wise mean
df.groupby('key').transform(lambda x: x - x.mean())

   data    random
0  -1.5 -0.296920
1  -1.5 -0.078934
2  -1.5  0.082568
3   1.5  0.296920
4   1.5  0.078934
5   1.5 -0.082568

In [125]:
# apply a function to the group results
def norm_by_data2(x):
    
    # x is a DataFrame of group values
    x['random'] /= x['data'].sum()
    return x

print(df,'\n'); print(df.groupby(df['key']).apply(norm_by_data2))

  key  data    random
0   A     0  0.191519
1   B     1  0.622109
2   C     2  0.437728
3   A     3  0.785359
4   B     4  0.779976
5   C     5  0.272593

  key  data    random
0   A     0  0.063840
1   B     1  0.124422
2   C     2  0.062533
3   A     3  0.261786
4   B     4  0.155995
5   C     5  0.038942

#### Specification of the split key

In [126]:
# group data by a specified list
L = [2, 0, 0, 0, 1, 1]
print(df,'\n'); print(df.groupby(L).sum())

  key  data    random
0   A     0  0.191519
1   B     1  0.622109
2   C     2  0.437728
3   A     3  0.785359
4   B     4  0.779976
5   C     5  0.272593

   data    random
0     6  1.845195
1     9  1.052568
2     0  0.191519

In [127]:
#a verbose way
print(df.groupby(df['key']).sum(),'\n')
print(df.groupby('key').sum())

     data    random
key
A       3  0.976878
B       5  1.402085
C       7  0.710320

     data    random
key
A       3  0.976878
B       5  1.402085
C       7  0.710320

In [128]:
#group data by mapping
df2 = df.set_index('key')
mapping = {'A': 'vowel', 'B': 'consonant', 'C': 'consonant'}
print(df2,'\n'); print(df2.groupby(mapping).sum())

     data    random
key
A       0  0.191519
B       1  0.622109
C       2  0.437728
A       3  0.785359
B       4  0.779976
C       5  0.272593

           data    random
consonant    12  2.112405
vowel         3  0.976878

In [129]:
#group data by function
print(df2,'\n'); print(df2.groupby(str.lower).mean())

     data    random
key
A       0  0.191519
B       1  0.622109
C       2  0.437728
A       3  0.785359
B       4  0.779976
C       5  0.272593

   data    random
a   1.5  0.488439
b   2.5  0.701042
c   3.5  0.355160

In [130]:
#group data by multi-index
df20 = df2.groupby([str.lower, mapping]).mean()
df20

             data    random
a vowel       1.5  0.488439
b consonant   2.5  0.701042
c consonant   3.5  0.355160

In [131]:
df20.index

MultiIndex([('a',     'vowel'),
            ('b', 'consonant'),
            ('c', 'consonant')],
           )

### Pivot Table

In [ ]:
# example dataset
import numpy as np
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head(6)

In [ ]:
# group by class and gender
# select survival, apply a mean aggregate
# unstack the hierarchical index
titanic.groupby(['sex', 'class'])['survived'].aggregate('mean')

In [ ]:
titanic.groupby(['sex', 'class'])['survived']

In [ ]:
titanic.groupby(['sex', 'class'])['survived'].aggregate('mean').unstack() #recall

In [ ]:
#pivot table alternative
titanic.pivot_table('survived', index='sex', columns='class')

In [ ]:
#multilevel pivot tables
#a third dimension, as an example
age = pd.cut(titanic['age'], [0, 18, 80])
titanic.pivot_table('survived', ['sex', age], 'class')

In [ ]:
# multilevel at columns
fare = pd.qcut(titanic['fare'], 2)
titanic.pivot_table('survived', ['sex', age], [fare, 'class'])

In [ ]:
#check on the quantiles
titanic['fare'].quantile(0.5)

In [ ]:
pd.DataFrame.pivot_table?

In [ ]:
#aggfunc: controls what type of aggregation is applied
titanic.pivot_table(index='sex', columns='class',
                    aggfunc={'survived':sum, 'fare':'mean'})

In [ ]:
#margins
titanic.pivot_table('survived', index='sex', columns='class', 
                    margins=True)

### String Operations

In [ ]:
# vectorized operation for numpy
data = ['peter', 'Paul', 'MARY', 'gUIDO']
[s.capitalize() for s in data]

In [ ]:
data = ['peter', 'Paul', None, 'MARY', 'gUIDO']
[s.capitalize() for s in data]

In [ ]:
# pandas is convenient
import pandas as pd
names = pd.Series(data)
names.str.capitalize()

In [ ]:
print(names,'\n')
print(names.str.upper(),'\n')
print(names.str.swapcase())

#### String methods available: 
len() lower() translate() islower() <br>
ljust() upper() startswith() isupper() <br>
rjust() find() endswith() isnumeric() <br>
center() rfind() isalnum() isdecimal() <br>
zfill() index() isalpha() split() <br>
strip() rindex() isdigit() rsplit() <br>
rstrip() capitalize() isspace() partition() <br>
lstrip() swapcase() istitle() rpartition() <br>

In [ ]:
monte = pd.Series(['Graham Chapman', 'John Cleese', 'Terry Gilliam',
'Eric Idle', 'Terry Jones', 'Michael Palin'])
monte.str.len()

In [ ]:
monte.str.startswith('T')

In [ ]:
pd.Series.str.split?

In [ ]:
monte.str.split()

#### Miscellaneous methods 
get() Index each element <br>
slice() Slice each element<br>
slice_replace() Replace slice in each element with passed value<br>
cat() Concatenate strings<br>
repeat() Repeat values<br>
normalize() Return Unicode form of string<br>
pad() Add whitespace to left, right, or both sides of strings<br>
wrap() Split long strings into lines with length less than a given width<br>
join() Join strings in each element of the Series with passed separator<br>
get_dummies() Extract dummy variables as a DataFrame

In [ ]:
#vectorized element access
monte.str[0:3]

In [ ]:
#last element of each entry
monte.str.split().str.get(-1)

In [ ]:
pd.concat([monte,monte.str.split().str.get(-1)],axis=1)

In [ ]:
full_monte = pd.DataFrame({'name': monte,
                           'info': ['B|C|D', 'B|D', 'A|C', 
                                    'B|D', 'B|C','B|C|D']})
full_monte

In [ ]:
#quickly split out these indicator variables into a DataFrame
full_monte['info'].str.get_dummies('|')